## Car yard Analysis

In [2]:
import pandas as pd

car = pd.read_excel("Car Dealer.xlsx")
car.head()

     Make   Model   Color  Mileage  Price  Cost
0   Honda  Accord     Red    63512   4000  3000
1   Honda  Accord    Blue    95135   2500  2000
2   Honda  Accord  Silver   101354   2000  1500
3  Toyota   Camry   Black    75006   2198  1900
4  Nissan  Altima   Green    69847   3826  3000

## How to dispaly specific columns

In [16]:
car = pd.read_excel("Car Dealer.xlsx", usecols='A, B, C')
car.head()

     Make   Model   Color
0   Honda  Accord     Red
1   Honda  Accord    Blue
2   Honda  Accord  Silver
3  Toyota   Camry   Black
4  Nissan  Altima   Green

## Count the number of cars

In [18]:
total_cars=car.shape[0]
print(total_cars)

24

## Summary of car colors

In [24]:
colors = car.pivot_table(index=[], columns=['Color'], aggfunc='count')
print(colors)

Color  Black  Blue  Green  Red  Silver  White
Make       6     3      3    3       6      3
Model      6     3      3    3       6      3

## Adding discount column

In [5]:
import pandas as pd
car = pd.read_excel("Car Dealer.xlsx")
car['Discounted_Price'] = car.apply(lambda row: row.Price - row.Cost, axis = 1)
print(car)

         Make      Model   Color  Mileage  Price  Cost  Discounted_Price
0       Honda     Accord     Red    63512   4000  3000              1000
1       Honda     Accord    Blue    95135   2500  2000               500
2       Honda     Accord  Silver   101354   2000  1500               500
3      Toyota      Camry   Black    75006   2198  1900               298
4      Nissan     Altima   Green    69847   3826  3000               826
5      Nissan     Altima   Green    55233   2970  2500               470
6      Toyota    Corolla   Black    87278   2224  2100               124
7      Toyota    Corolla    Blue   130684   2798  2200               598
8      Toyota    Corolla  Silver    59169   2160  2000               160
9       Honda      Civic   White   138789   2723  1900               823
10       Ford      F-150   Black    89073   3950  3000               950
11  Chevrolet  Silverado   Green   109231   4959  4500               459
12  Chevrolet     Impala  Silver    87675   3791  3500               291
13  Chevrolet     Impala   White   140811   2340  2000               340
14  Chevrolet     Malibu   White   139300   3361  3000               361
15       Ford     Escape   Black    63259   3196  3050               146
16       Ford     Escape     Red    40826   4397  3900               497
17       Ford    Mustang  Silver    41560   3706  3100               606
18      Honda        CRV    Blue    49326   4745  4100               645
19     Nissan     Maxima     Red   101856   2914  2500               414
20       Ford     Fusion   Black    42542   2659  2100               559
21      Dodge    Charger  Silver    34853   4349  3500               849
22      Dodge    Charger  Silver    58173   4252  4000               252
23      Dodge    Charger   Black   136775   2090  1800               290

## Summary of number of each make in the yard

In [7]:
colors = car.pivot_table(index=[], columns=['Make'], aggfunc='count')
print(colors)

Make              Chevrolet  Dodge  Ford  Honda  Nissan  Toyota
Color                     4      3     5      5       3       4
Cost                      4      3     5      5       3       4
Discounted_Price          4      3     5      5       3       4
Mileage                   4      3     5      5       3       4
Model                     4      3     5      5       3       4
Price                     4      3     5      5       3       4

## List of car make with mileage gratee than 30000

In [19]:
car[car['Mileage'] > 80000]

         Make      Model   Color  Mileage  Price  Cost  Discounted_Price
1       Honda     Accord    Blue    95135   2500  2000               500
2       Honda     Accord  Silver   101354   2000  1500               500
6      Toyota    Corolla   Black    87278   2224  2100               124
7      Toyota    Corolla    Blue   130684   2798  2200               598
9       Honda      Civic   White   138789   2723  1900               823
10       Ford      F-150   Black    89073   3950  3000               950
11  Chevrolet  Silverado   Green   109231   4959  4500               459
12  Chevrolet     Impala  Silver    87675   3791  3500               291
13  Chevrolet     Impala   White   140811   2340  2000               340
14  Chevrolet     Malibu   White   139300   3361  3000               361
19     Nissan     Maxima     Red   101856   2914  2500               414
23      Dodge    Charger   Black   136775   2090  1800               290

## mileage is greater than 80000 and price 2000

In [24]:
car[(car['Mileage'] > 80000) & (car['Price'] >3000)]

         Make      Model   Color  Mileage  Price  Cost  Discounted_Price
10       Ford      F-150   Black    89073   3950  3000               950
11  Chevrolet  Silverado   Green   109231   4959  4500               459
12  Chevrolet     Impala  Silver    87675   3791  3500               291
14  Chevrolet     Malibu   White   139300   3361  3000               361